{
    "cards": {
        "Om mig": [
            {
                "title": "Johan Bägerfeldt",
                "place": "johan.bagerfeldt@gmail.com",
                "link": "https://www.linkedin.com/in/johba/",
                "content": "Välkommen till min portfolio! Jag heter Johan och jobbar för närvarande som mjukvaruingenjör på Aurobay i Skövde. På fritiden skapar jag olika spel och program för nöjes skull, både på egen hand och i samarbete med andra.<br><br>Jag har erfarenhet av flera programmeringsspråk, inklusive Java, Python, C++, C#, och JavaScript. Jag är också intresserad av AI och hur det kan användas för att förbättra mjukvaruutveckling, då jag redan använder GitHub Copilot för att effektivisera och accelerera mitt arbetsflöde.<br><br>Hör gärna av dig om du vill veta mer!",
                "image": "images/me.png"
            }
        ],
        "arbetserfarenhet": [
            {
                "title": "Mjukvaruingenjör",
                "link": "https://www.aurobay.com/",
                "image": "images/logo/aurobay.png",
                "place": "Aurobay",
                "date": "Juni 2023 - Nuvarande",
                "content": "Mjukvaruingenjör med fokus på backend-utveckling i Java, med agila metoder. Ansvarig för att designa och implementera nya funktioner, samt underhålla och förbättra den befintliga kodbasen. Samarbetar för att säkerställa hög kvalitet och effektivitet i utvecklingsprocessen."
            },
            {
                "title": "Sommarjobb",
                "link": "https://www.sommarland.se/sommarjobb",
                "image": "images/logo/sommarland.png",
                "place": "Skara Sommarland",
                "date": "Sommar 2016, 2017, och 2018",
                "content": "Arbetade som Parkvärd och Butiksvärd under tre somrar med ansvar för försäljning och parkunderhåll. Utvecklade mina kommunikations- och problemlösningsförmågor genom nära samarbete med besökare och kollegor."
            }
        ],
        "utbildning": [
            {
                "title": "Datavetenskap",
                "link": "https://www.his.se/utbildning/data-och-it/datavetenskap-inriktning-systemutveckling-dvsug/",
                "image": "images/logo/his.jpg",
                "place": "Högskolan i Skövde",
                "date": "Augusti 2020 - Juni 2023",
                "content": "Utbildningen inkluderade kurser i systemutveckling, algoritmer, databaser, statistik, och AI. Examensarbetet undersökte effektiviteten av automatisk kodgenerering med AI. Fördjupade min förståelse för mjukvaruutveckling och problemlösning genom praktiska projekt och samarbeten. Programmeringsspråk som användes inkluderar Java, C++, Python, och JavaScript."
            },
            {
                "title": "Civilekonomprogrammet",
                "link": "https://www.oru.se/utbildning/program/civilekonomprogrammet/",
                "image": "images/logo/oru.png",
                "place": "Örebro universitet",
                "date": "Januari 2018 - Januari 2020",
                "content": "Utvecklade kunskaper inom ekonomisk teori genom kurser i nationalekonomi, företagsekonomi, och marknadsföring. Bytte inriktning till datavetenskap för att fokusera på programmering och systemutveckling."
            }
        ],
        "projekt": [
            {
                "title": "Interaktiv Discord-bot",
                "place": "JavaScript",
                "link": "https://github.com/JohBag/WST-Discord-Bot",
                "image": "images/logo/bot.png",
                "content": "Utvecklade en interaktiv Discord-bot i JavaScript med AI från OpenAI och Microsoft Azure, inklusive GPT-4, Whisper, DALL·E, och Azure Text-to-Speech. Boten interagerar med användare via text och röst, genererar bilder från textbeskrivningar, och automatiserar rutinuppgifter med hjälpsamma funktioner."
            },
            {
                "title": "Bluevolution",
                "place": "GameMaker",
                "link": "https://store.steampowered.com/app/1324040/Bluevolution/",
                "image": "images/logo/bluevolution.png",
                "content": "Egenutvecklat spel gjort i GameMaker Studio 2 och släppt på Steam. Bluevolution är ett spel där du försvarar planeter från vågor av asteroider genom att använda olika vapen och uppgraderingar. Det här spelet gjordes innan jag började min utbildning i datavetenskap och gjorde det möjligt för mig att lära mig hela spelutvecklingsprocessen, från koncept till release."
            },
            {
                "title": "TinyMap",
                "place": "Godot",
                "image": "images/logo/tinymap.png",
                "content": "Mitt drömspel under utveckling i Godot. TinyMap är ett strategispel med fokus på ekonomi, där spelaren bygger upp en civilisation från grunden och måste hantera resurser och fatta strategiska beslut för att överleva i en utmanande värld. Inspirerat av Anno- och Civilization-serierna."
            },
            {
                "title": "Övrig spelutveckling",
                "place": "Godot, Unity, GameMaker",
                "link": "https://johbag.itch.io/",
                "image": "images/logo/player.png",
                "content": "På min itch.io-sida kan du hitta flera mindre spel och projekt som jag har skapat. Många av dessa är experimentella och skapades för att utforska olika speldesignkoncept och tekniker, framför allt innan jag började studera datavetenskap."
            }
        ]
    }
}